# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategorySet..::..Contains Method
CategorySet Class See Also
---
Tests for the existence of a category within the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	Category item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As Category _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	Category^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..CategoryThe category to be searched for.
# ### Return Value
The Contains method returns True if the category is within the set, otherwise False.
# See Also
CategorySet Class
Autodesk.Revit.DB Namespace